def main():
    MorseCode = {'a': '.-', 'b': '-...', 'w': '.--', 'g': '--.', 'd': '-..', 'e': '.', 'v': '...-',
                 'z': '--..', 'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.',
                 'o': '---', 'p': '.--.', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'f': '..-.',
                 'h': '....', 'c': '-.-.', 'q': '--.-', 'y': '-.--', 'x': '-..-', 'а': '.-',
                 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.',
                 'ё': '.', 'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---',
                 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---',
                 'п': '.--.', 'р': '.-.', 'с': '...', 'т': '-', 'у': '..-',
                 'ф': '..-.', 'х': '....', 'ц': '-.-.', 'ч': '---.',
                 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--',
                 'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-',
                 '0': '-----', '1': '.----', '2': '..---', '3': '...--',
                 '4': '....-', '5': '..... ', '6': '-....', '7': '--...',
                 '8': '---..', '9': '----.'}
    MorseCodeEn = {'a': '.-', 'b': '-...', 'w': '.--', 'g': '--.', 'd': '-..', 'e': '.', 'v': '...-',
                 'z': '--..', 'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.',
                 'o': '---', 'p': '.--.', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'f': '..-.',
                 'h': '....', 'c': '-.-.', 'q': '--.-', 'y': '-.--', 'x': '-..-', '0': '-----',
                 '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '..... ', '6': '-....',
                 '7': '--...', '8': '---..', '9': '----.'}

    MorseCodeRu = {'а': '.-',
                 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.',
                 'ё': '.', 'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---',
                 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---',
                 'п': '.--.', 'р': '.-.', 'с': '...', 'т': '-', 'у': '..-',
                 'ф': '..-.', 'х': '....', 'ц': '-.-.', 'ч': '---.',
                 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--',
                 'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-',
                 '0': '-----', '1': '.----', '2': '..---', '3': '...--',
                 '4': '....-', '5': '..... ', '6': '-....', '7': '--...',
                 '8': '---..', '9': '----.'}

    def encode_to_morse(text):
        s = []
        text = text.lower().split()
        for i in range(len(text)):
            a = []
            for j in range(len(text[i])):
                if text[i][j] in MorseCode:
                    a.append(MorseCode[text[i][j]])
                else:
                    a.append(text[i][j])
            s.append(' '.join(a))
        print('\n'.join(s))
        return

    def decode_from_morse(code):
        t = input('Выберите язык перевода: 1 - русский, 2 - английский')
        s = []
        code = code.split()
        for i in range(len(code)):
            if t == '1':
                if code[i] in list(MorseCodeRu.values()):
                    s.append(list(MorseCodeRu.keys())[list(MorseCodeRu.values()).index(code[i])])
                else:
                    s.append(code[i])
            else:
                if code[i] in list(MorseCodeEn.values()):
                    s.append(list(MorseCodeEn.keys())[list(MorseCodeEn.values()).index(code[i])])
                else:
                    s.append(code[i])
        print(''.join(s))
        return

    print('Это программа-переводчик морзянки')
    print('Если вы хотите закодировать текст на морзянку нажмите 1')
    print('Если вы хотите раскодировать текст с морзянки нажмите 2')
    p = int(input())
    if p == 1:
        text = input('Введите текст на русском или на английском языке')
        encode_to_morse(text)
    elif p == 2:
        code = input('Введите текст на морзянке')
        decode_from_morse(code)


while 5 > 0:
    main()
